
# МАТЕМАТИКА
math_dictionary = {1: 'Разделите 100 на половину:',
                    2: 'У старика было 7 сыновей, а у каждого сына по сестре. Сколько всего детей у старика?',
                    3: 'Чему равно значение выражения? -> 2+2-2+2-2+2-2+2-2+2',
                    4: 'Продолжи последовательность 1, 1, 2, 3, 5, 8, 13, ... ',
                    5: 'Найдите сумму 1+2+3+….+98+99+100: ',
                    6: "Какой получится результат, если наименьшее ЧЕТЫРЕХЗНАЧНОЕ число умножить на 100",
                    7: 'Двое шахматистов играли в шахматы 2 часа. Сколько времени играл каждый?',
                    8: 'Ты да я, да мы с тобой. Сколько нас?',
                    9: 'Из скольких цветов состоит радуга? ',
                    10: 'Какой знак надо поставить между 0 и 1, чтобы получилось число больше 0 и меньше 1?'}

math_answer = ['C', 'C', 'B', 'D', 'B', 'B', 'A','B','C','C']

math_dict_allanswer = {1: ['100', '50', '200', '300'],
                    2: ['7', '15', '8', '14'],
                    3: ['20','4','0','6'],
                    4: ['7','14','18','21'],
                    5: ['10000','5050','2020','1500'],
                    6: ['10^4 -> (1000)','10^5 -> (100000)','10^6 -> (1000000)','10^7 -> (10000000)'],
                    7: ['2','4','3','1'],
                    8: ['1','2','3','4'],
                    9: ['8','9','7','6'],
                    10: ['> +','> -','> ,','> /'] 
}

# ЗВЕЗДНЫЕ ВОЙНЫ
starWars_dictionary = {1: 'В какой период Джордж Лукас придумал "Звёздные войны"?',
                    2: 'Кем Дарт Вейдер приходится Люку Скайуокеру?',
                    3: 'Как раньше звали Дарта Вейдера?',
                    4: 'Как переводится слово "вейдер" ("vader") с голландского?',
                    5: 'Почему фанаты саги "Звёздные войны" празднуют день 4 мая?',
                    6: 'Что означает имя Йода на санскрите?',
                    7: 'Какое животное стало прообразом персонажа Чубакки?',
                    8: 'Какого цвета был световой меч Люка Скайуокера?',
                    9: 'Название планеты Татуин совпадает с названием реального города. В какой стране находится этот город?',
                    10: 'Джаба Хатт говорит на одном из диалектов существующего языка. Какой это язык?'}

starWars_answer = ['A', 'C', 'B', 'A', 'D', 'C', 'C', 'B', 'C', 'D']

starWars_allanswer = {1:['1970-е', '1980-е', '1990-е', '2000-е'],
                      2:['Это его учитель', 'Это его брат', 'Это его отец', 'Это его дедушка'],
                      3:['Джордж', 'Энакин', 'Палпатин', 'Оби-Ван'],
                      4:['Отец', 'Злодей', 'Властелин', 'Чёрный'],
                      5:['В этот день родился Люк Скайуокер', 'В этот день родился Джордж Лукас', '4 мая Йода стал главой Совета джедаев', 'Фраза "Да пребудет с тобой сила" на английском звучит как каламбур "4 мая с тобой" (May the 4th be with you)'],
                      6:['Просветлённый', 'Зелёный', 'Боец', 'Знаток'],
                      7:['Орангутанг', 'Медведь', 'Собака', 'Шимпанзе'],
                      8:['Фиолетовый', 'Зеленый', 'Голубой', 'Красный'],
                      9:['Турция', 'Греция', 'Тунис', 'Малайзия'],
                      10:['Китайский', 'Алеутский', 'Зулу', 'Вьетнамский']}


# Гарри Поттер

HP_dictionary = {1:'Когда родился Гарри Поттер?',
                2:'Какого привидения никогда не было в Хогвартсе?',
                3:'Как попасть в гостиную Когтервана?',
                4:'Кто составил пару для Гарри на Святочном балу во время открытия Турнира Трех Волшебников?',
                5:'Из чего состоит палочка Драко Малфоя?',
                6:'В каком возрасте погиб Альбус Дамблдор?',
                7:'Какой природный элемент из четырёх существующих соответствует факультету Когтерван?',
                8:'Чем закончился бой на волшебных палочках между Минервой МакГонагалл и Северусом Снейпом?',
                9:'Как Гарри, Рон и Гермиона смогли выбраться их банка Гринготтс?',
                10:'Как зовут создателя первого и единственного в мире Философского камня?'}

HP_answer = ['A', 'A', 'B', 'D', 'C', 'B', 'A', 'D', 'A', 'B']

HP_allanswer = {1:['31 июля 1980', '31 августа 1980', '30 июля 1980', ''],
                2:['Друри Лейн', 'Пивз', 'Бинс', 'Плакса Миртл'],
                3:['Сказать пароль', 'Повторить стук в определённом ритме', 'Ответить на вопрос', 'Повернуть секретный рычаг'],
                4:['Гермиона Грейнджер', 'Полумна Лавгуд', 'Падма Патил', 'Парвати Патил'],
                5:['Остролист со вставкой из пера феникса', 'Перо птицы-гром и шерсть Ругару', 'Боярышник и волос единорога', ' Волос вейлы и сердечная жила дракона'],
                6:['117', '115', '113', '116'],
                7:['Воздух', 'Земля', 'Огонь', 'Вода'],
                8:['Они помирились', 'Минерва была смертельно ранена', 'Снейп сбежал через окно в Большом Зале', 'Северус был убит'],
                9:['Верхом на драконе', 'Использовали плащ невидимку', 'Они не проникли в банк', 'Выпили оборотное зелье и превратились в других людей'],
                10:['Оливер Фламель', 'Николас Фламель', 'Николас Риксон', 'Оливер Риксон']}